[Killed] Regex
src/auth/auth.service.ts:22:24
   ) {}
   
   async register(registerDto: RegisterDto): Promise<{ user: any; token: string }> {
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const emailRegex = /^[^\S@]+@[^\s@]+\.[^\s@]+$/;
     if (!emailRegex.test(registerDto.email)) {
       throw new ConflictException('Invalid email format');
killedBy: AuthService - Equivalence Analysis Проверка адреса электронной почты на соответствие формату должен принять электронную почту по причине: валидная форма почты
statusReason: Error: expect(received).resolves.toBeDefined()

Received promise rejected instead of resolved
Rejected to value: [ConflictException: Invalid email format]

[Killed] Regex
src/auth/auth.service.ts:22:24
   ) {}
   
   async register(registerDto: RegisterDto): Promise<{ user: any; token: string }> {
-    const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
+    const emailRegex = /[^\s@]+@[^\s@]+\.[^\s@]+$/;
     if (!emailRegex.test(registerDto.email)) {
       throw new ConflictException('Invalid email format');
killedBy: AuthService - Equivalence Analysis Тесты после выявленных первой мутацией уязвимостей   должен отклонить email, который не начинается с начала строки (убивает мутацию regex без ^)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: ConflictException
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'id')"

      121 |       const savedUser = await this.usersRepository.save(user);

[Killed] BlockStatement
src/auth/auth.service.ts:23:46
   
   async register(registerDto: RegisterDto): Promise<{ user: any; token: string }> {
     const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!emailRegex.test(registerDto.email)) {
-      throw new ConflictException('Invalid email format');
-    }
+    if (!emailRegex.test(registerDto.email)) {}
 
 
killedBy: AuthService - Equivalence Analysis Тесты после выявленных первой мутацией уязвимостей   должен отклонить email, который не начинается с начала строки (убивает мутацию regex без ^)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: ConflictException
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'id')"

      121 |       const savedUser = await this.usersRepository.save(user);

[Killed] ConditionalExpression
src/auth/auth.service.ts:23:9
   
   async register(registerDto: RegisterDto): Promise<{ user: any; token: string }> {
     const emailRegex = /^[^\s@]+@[^\s@]+\.[^\s@]+$/;
-    if (!emailRegex.test(registerDto.email)) {
+    if (false) {
       throw new ConflictException('Invalid email format');
     }
killedBy: AuthService - Equivalence Analysis Тесты после выявленных первой мутацией уязвимостей   должен отклонить email, который не начинается с начала строки (убивает мутацию regex без ^)
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: ConflictException
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'id')"

      121 |       const savedUser = await this.usersRepository.save(user);

[Killed] MethodExpression
src/auth/auth.service.ts:28:24
     }
 
 
-    registerDto.name = registerDto.name.trim();
+    registerDto.name = registerDto.name;
     if (registerDto.password.length < 4 || registerDto.password.length > 20) {
       throw new ConflictException('Password must be at least 4 and 20 maximum characters long');
killedBy: AuthService - Boundary Value Analysis Граничные тесты (BVA) на длину имени с trim должен отклонить имя по причине: Имя с пробелами, длина 3 после trim — ниже минимума
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: ConflictException
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'id')"

      121 |       const savedUser = await this.usersRepository.save(user);

[Killed] EqualityOperator
src/auth/auth.service.ts:29:44
 
 
     registerDto.name = registerDto.name.trim();
-    if (registerDto.password.length < 4 || registerDto.password.length > 20) {
+    if (registerDto.password.length < 4 || registerDto.password.length <= 20) {
       throw new ConflictException('Password must be at least 4 and 20 maximum characters long');
     }
killedBy: AuthService - Boundary Value Analysis Граничные тесты(BVA) на длину пароля должен принять пароль по причине: 4 знака - граница минимума
statusReason: Error: expect(received).resolves.toBeDefined()

Received promise rejected instead of resolved
Rejected to value: [ConflictException: Password must be at least 4 and 20 maximum characters long]

[Killed] EqualityOperator
src/auth/auth.service.ts:29:44
 
 
     registerDto.name = registerDto.name.trim();
-    if (registerDto.password.length < 4 || registerDto.password.length > 20) {
+    if (registerDto.password.length < 4 || registerDto.password.length >= 20) {
       throw new ConflictException('Password must be at least 4 and 20 maximum characters long');
     }
killedBy: AuthService - Boundary Value Analysis Граничные тесты(BVA) на длину пароля должен принять пароль по причине: 20 знаков - максимальная граница
statusReason: Error: expect(received).resolves.toBeDefined()

Received promise rejected instead of resolved
Rejected to value: [ConflictException: Password must be at least 4 and 20 maximum characters long]

[Killed] ConditionalExpression
src/auth/auth.service.ts:33:9
       throw new ConflictException('Password must be at least 4 and 20 maximum characters long');
     }
 
-    if (registerDto.name.length < 4 || registerDto.name.length > 20) {
+    if (true) {
       throw new ConflictException('Name must be at least 4 and 20 maximum characters long');
     }
killedBy: AuthService - Boundary Value Analysis Граничные тесты(BVA) на длину пароля должен принять пароль по причине: 4 знака - граница минимума
statusReason: Error: expect(received).resolves.toBeDefined()

Received promise rejected instead of resolved
Rejected to value: [ConflictException: Name must be at least 4 and 20 maximum characters long]

[Killed] EqualityOperator
src/auth/auth.service.ts:33:9
       throw new ConflictException('Password must be at least 4 and 20 maximum characters long');
     }
 
-    if (registerDto.name.length < 4 || registerDto.name.length > 20) {
+    if (registerDto.name.length >= 4 || registerDto.name.length > 20) {
       throw new ConflictException('Name must be at least 4 and 20 maximum characters long');
     }
killedBy: AuthService - Boundary Value Analysis Граничные тесты(BVA) на длину пароля должен принять пароль по причине: 4 знака - граница минимума
statusReason: Error: expect(received).resolves.toBeDefined()

Received promise rejected instead of resolved
Rejected to value: [ConflictException: Name must be at least 4 and 20 maximum characters long]

[Killed] StringLiteral
src/auth/auth.service.ts:34:35
     }
 
     if (registerDto.name.length < 4 || registerDto.name.length > 20) {
-      throw new ConflictException('Name must be at least 4 and 20 maximum characters long');
+      throw new ConflictException("");
     }
     //console.log('Register attempt for email:', registerDto.email);
killedBy: AuthService - Boundary Value Analysis Тесты после выявленных первой мутацией уязвимостей   должен выбросить исключение с точным сообщением для имени короче 4 символов
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Name must be at least 4 and 20 maximum characters long"
Received message:   "Conflict"

      92 |         } else {
      93 |           stryCov_9fa48("38");
    > 94 |           throw new ConflictException(stryMutAct_9fa48("39") ? "" : (stryCov_9fa48("39"), 'Name must be at least 4 and 20 maximum characters long'));

[Killed] ObjectLiteral
src/auth/auth.service.ts:39:14
     //console.log('Register attempt for email:', registerDto.email);
     
     const existingUser = await this.usersRepository.findOne({
-      where: { email: registerDto.email }
+      where: {}
     });
 
killedBy: AuthService - Equivalence Analysis Тесты после выявленных первой мутацией уязвимостей   должен искать пользователя по email при регистрации
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "email": "unique@example.com",

[Killed] BlockStatement
src/auth/auth.service.ts:44:23
 
     //console.log('Existing user found:', existingUser);
 
-    if (existingUser) {
-      //console.log('User already exists with ID:', existingUser.id);
-      throw new ConflictException('User with this email already exists');
-    }
+    if (existingUser) {}
     const hashedPassword: string = await bcrypt.hash(registerDto.password, 12);
     
killedBy: AuthService - Equivalence Analysis Регистрация пользователя equivalence classes должен предотвратить регистрацию по причине Существующий адрес электронной почты пользователя
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected constructor: ConflictException
Received constructor: TypeError

Received message: "Cannot read properties of undefined (reading 'id')"

      121 |       const savedUser = await this.usersRepository.save(user);

[Killed] BlockStatement
src/auth/auth.service.ts:68:51
     return { user: userWithoutPassword, token };
   }
 
-  async deleteUser(userId: string): Promise<void> {
-    const user = await this.usersRepository.findOne({ 
-        where: { id: userId } 
-    });
-    
-    if (!user) {
-        throw new NotFoundException('Пользователь не найден');
-    }
-    
-    await this.usersRepository.remove(user);
-  }
+  async deleteUser(userId: string): Promise<void> {}
 
   async findUserById(userId: string): Promise<User | null> {
killedBy: AuthService - Equivalence Analysis Тесты после выявленных первой мутацией уязвимостей   должен удалить пользователя в deleteUser
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: {"where": {"id": "123"}}

Number of calls: 0

[NoCoverage] StringLiteral
src/auth/auth.service.ts:90:46
       });
     } catch (error) {
       console.error('Error fetching users:', error);
-      throw new InternalServerErrorException('Could not fetch users');
+      throw new InternalServerErrorException("");
     }
   }

[Killed] ObjectLiteral
src/auth/auth.service.ts:98:53
     // eslint-disable-next-line no-useless-catch
     try {
     //console.log('Login dto:', loginDto);
-    const user = await this.usersRepository.findOne({
-      where: { email: loginDto.email }
-    });
+    const user = await this.usersRepository.findOne({});
     //console.log('User found:', user);
     if (!user) {
killedBy: AuthService - Equivalence Analysis Тесты после выявленных первой мутацией уязвимостей   должен искать пользователя по email при login
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "email": "test@example.com",

[Killed] BlockStatement
src/auth/auth.service.ts:106:27
       throw new UnauthorizedException('Invalid email or password');
     }
     const isPasswordValid = await bcrypt.compare(loginDto.password, user.password);
-    if (!isPasswordValid) {
-      throw new UnauthorizedException('Invalid email or password');
-    }
+    if (!isPasswordValid) {}
 
     const token = this.jwtService.sign({ 
killedBy: AuthService - Equivalence Analysis Пользовательский вход equivalence classes должен предотвратить логин по причине Неправильный пароль
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"token": "mock-jwt-token", "user": {"email": "test@example.com", "id": "user-123", "name": "Test User"}}

[Killed] ConditionalExpression
src/auth/auth.service.ts:106:9
       throw new UnauthorizedException('Invalid email or password');
     }
     const isPasswordValid = await bcrypt.compare(loginDto.password, user.password);
-    if (!isPasswordValid) {
+    if (false) {
       throw new UnauthorizedException('Invalid email or password');
     }
killedBy: AuthService - Equivalence Analysis Пользовательский вход equivalence classes должен предотвратить логин по причине Неправильный пароль
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: {"token": "mock-jwt-token", "user": {"email": "test@example.com", "id": "user-123", "name": "Test User"}}

[Killed] StringLiteral
src/auth/auth.service.ts:107:39
     }
     const isPasswordValid = await bcrypt.compare(loginDto.password, user.password);
     if (!isPasswordValid) {
-      throw new UnauthorizedException('Invalid email or password');
+      throw new UnauthorizedException("");
     }
 
killedBy: AuthService - Equivalence Analysis Тесты после выявленных первой мутацией уязвимостей   должен выбросить исключение с точным сообщением "Invalid email or password" при неверном пароле в login
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Invalid email or password"
Received message:   "Unauthorized"

      230 |             } else {
      231 |               stryCov_9fa48("83");
    > 232 |               throw new UnauthorizedException(stryMutAct_9fa48("84") ? "" : (stryCov_9fa48("84"), 'Invalid email or password'));

[NoCoverage] ObjectLiteral
src/auth/auth.service.ts:129:62
   }
 
   async getProfile(userId: string): Promise<Omit<User, 'password'>> {
-    const user = await this.usersRepository.findOne({ where: { id: userId } });
+    const user = await this.usersRepository.findOne({ where: {} });
     if (!user) {
       throw new UnauthorizedException('User not found');

[NoCoverage] StringLiteral
src/auth/auth.service.ts:150:35
     const user = await this.usersRepository.findOne({ where: { id: userId } });
     
     if (!user) {
-      throw new NotFoundException('User not found');
+      throw new NotFoundException("");
     }
 
