[Killed] BlockStatement
src/task/task.service.ts:40:9
   async createTask(boardId: string, createTaskDto: CreateTaskDto, currentUserId: string): Promise<Task> {
     const board = await this.getBoardById(boardId);
     
-    try {
-      await firstValueFrom(
-        this.httpService.get(`${process.env.API_GATEWAY_URL || 'http://api-gateway:3000'}/users/${createTaskDto.assigneeId}`)
-      );
-    } catch (error) {
+    try {} catch (error) {
       // console.log('Error', error)
       // console.warn(`Assignee ${createTaskDto.assigneeId} not found, using current user: ${currentUserId}`);
killedBy: TaskService - Branch Testing Ветвление в методе createTask должен использовать текущего пользователя, если assignee не найден (ветка false)
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
src/task/task.service.ts:42:33
     
     try {
       await firstValueFrom(
-        this.httpService.get(`${process.env.API_GATEWAY_URL || 'http://api-gateway:3000'}/users/${createTaskDto.assigneeId}`)
+        this.httpService.get(`${true}/users/${createTaskDto.assigneeId}`)
       );
     } catch (error) {

[Survived] LogicalOperator
src/task/task.service.ts:42:33
     
     try {
       await firstValueFrom(
-        this.httpService.get(`${process.env.API_GATEWAY_URL || 'http://api-gateway:3000'}/users/${createTaskDto.assigneeId}`)
+        this.httpService.get(`${process.env.API_GATEWAY_URL && 'http://api-gateway:3000'}/users/${createTaskDto.assigneeId}`)
       );
     } catch (error) {

[Killed] BlockStatement
src/task/task.service.ts:44:21
       await firstValueFrom(
         this.httpService.get(`${process.env.API_GATEWAY_URL || 'http://api-gateway:3000'}/users/${createTaskDto.assigneeId}`)
       );
-    } catch (error) {
-      // console.log('Error', error)
-      // console.warn(`Assignee ${createTaskDto.assigneeId} not found, using current user: ${currentUserId}`);
-      createTaskDto.assigneeId = currentUserId;
-    }
+    } catch (error) {}
 
     const task = this.tasksRepository.create({
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен изменять assigneeId в блоке catch
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"assigneeId": "current-user-123"}
Received: {"assigneeId": "non-existent-user", "boardId": "board-123", "description": "", "priority": "low", "reporterId": "current-user-123", "status": "todo", "tags": [], "title": "Test Task"}

Number of calls: 1

[Killed] LogicalOperator
src/task/task.service.ts:54:15
       ...createTaskDto,
       boardId: board.id,
       reporterId: currentUserId,
-      status: createTaskDto.status || TaskStatus.TODO,
+      status: createTaskDto.status && TaskStatus.TODO,
     });
 
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен использовать значение по умолчанию для статуса
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: ObjectContaining {"status": "todo"}
Received: {"assigneeId": "user-123", "boardId": "board-123", "description": "", "priority": "low", "reporterId": "user-123", "status": undefined, "tags": [], "title": "Test Task"}

Number of calls: 1

[Killed] BlockStatement
src/task/task.service.ts:59:53
 
     const savedTask = await this.tasksRepository.save(task);
 
-    if (createTaskDto.assigneeId !== currentUserId) {
-    await this.sendNotification({
-        userId: createTaskDto.assigneeId,
-        title: 'Новая задача назначена',
-        message: `Вам назначена задача "${createTaskDto.title}"`,
-        type: 'task_assigned',
-        data: {
-          taskId: savedTask.id,
-          boardId: boardId,
-          assignedBy: currentUserId
-        }
-      });
-    }
+    if (createTaskDto.assigneeId !== currentUserId) {}
 
     return savedTask;
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен отправлять уведомление только если assignee отличается от reporter
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ConditionalExpression
src/task/task.service.ts:59:9
 
     const savedTask = await this.tasksRepository.save(task);
 
-    if (createTaskDto.assigneeId !== currentUserId) {
+    if (false) {
     await this.sendNotification({
         userId: createTaskDto.assigneeId,
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен отправлять уведомление только если assignee отличается от reporter
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] ObjectLiteral
src/task/task.service.ts:60:33
     const savedTask = await this.tasksRepository.save(task);
 
     if (createTaskDto.assigneeId !== currentUserId) {
-    await this.sendNotification({
-        userId: createTaskDto.assigneeId,
-        title: 'Новая задача назначена',
-        message: `Вам назначена задача "${createTaskDto.title}"`,
-        type: 'task_assigned',
-        data: {
-          taskId: savedTask.id,
-          boardId: boardId,
-          assignedBy: currentUserId
-        }
-      });
+    await this.sendNotification({});
     }
 
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен проверять корректность данных в уведомлении
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  "http://api-gateway:3000/notifications",
- Object {
-   "data": Object {

[Killed] ObjectLiteral
src/task/task.service.ts:80:14
   async getBoardTasks(boardId: string): Promise<Task[]> {
     await this.getBoardById(boardId);
     return this.tasksRepository.find({
-      where: { boardId },
+      where: {},
       order: { order: 'ASC', createdAt: 'DESC' },
     });
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен вернуть задачи доски с правильным порядком
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "order": Object {
      "createdAt": "DESC",

[Killed] ObjectLiteral
src/task/task.service.ts:99:53
 
 
   async updateTask(taskId: string, updateTaskDto: UpdateTaskDto): Promise<Task> {
-    const task = await this.tasksRepository.findOne({ where: { id: taskId } });
+    const task = await this.tasksRepository.findOne({});
     
     if (!task) {
killedBy: TaskService - Decision Testing Тестирование решений в методе updateTask должен обновить задачу, если она существует (решение true)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "id": "task-123",

[Killed] StringLiteral
src/task/task.service.ts:102:35
     const task = await this.tasksRepository.findOne({ where: { id: taskId } });
     
     if (!task) {
-      throw new NotFoundException('Task not found');
+      throw new NotFoundException("");
     }
 
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен выбросить NotFoundException с правильным сообщением в updateTask
statusReason: Error: expect(received).rejects.toThrow(expected)

Expected substring: "Task not found"
Received message:   "Not Found"

      188 |         } else {
      189 |           stryCov_9fa48("51");
    > 190 |           throw new NotFoundException(stryMutAct_9fa48("52") ? "" : (stryCov_9fa48("52"), 'Task not found'));

[Killed] ObjectLiteral
src/task/task.service.ts:112:53
   }
 
   async updateTaskStatus(taskId: string, status: TaskStatus, order: number): Promise<Task> {
-    const task = await this.tasksRepository.findOne({ where: { id: taskId } });
+    const task = await this.tasksRepository.findOne({});
     
     if (!task) {
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен обновить статус задачи (решение: существует?)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "id": "task-123",

[Killed] ObjectLiteral
src/task/task.service.ts:125:53
   }
 
   async deleteTask(taskId: string, userId: string): Promise<Task> {
-    const task = await this.tasksRepository.findOne({ where: { id: taskId } });
+    const task = await this.tasksRepository.findOne({});
     
     if (!task) {
killedBy: TaskService - Decision Testing Тестирование решений в методе deleteTask Тестовый случай 1: Задача существует и пользователь - создатель (true/false) должен корректно обработать задачу
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "id": "task-123",

[Killed] ObjectLiteral
src/task/task.service.ts:125:62
   }
 
   async deleteTask(taskId: string, userId: string): Promise<Task> {
-    const task = await this.tasksRepository.findOne({ where: { id: taskId } });
+    const task = await this.tasksRepository.findOne({ where: {} });
     
     if (!task) {
killedBy: TaskService - Decision Testing Тестирование решений в методе deleteTask Тестовый случай 1: Задача существует и пользователь - создатель (true/false) должен корректно обработать задачу
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
-   "where": Object {
-     "id": "task-123",

[Killed] BlockStatement
src/task/task.service.ts:131:37
       throw new NotFoundException('Task not found');
     }
 
-    if (task.reporterId !== userId) {
-      throw new ForbiddenException('You can only delete tasks you created');
-    }
+    if (task.reporterId !== userId) {}
 
     return this.tasksRepository.remove(task);
killedBy: TaskService - Decision Testing Тестирование решений в методе deleteTask Тестовый случай 2: Задача существует, но пользователь не создатель (true/false) должен корректно обработать задачу
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ConditionalExpression
src/task/task.service.ts:131:9
       throw new NotFoundException('Task not found');
     }
 
-    if (task.reporterId !== userId) {
+    if (false) {
       throw new ForbiddenException('You can only delete tasks you created');
     }
killedBy: TaskService - Decision Testing Тестирование решений в методе deleteTask Тестовый случай 2: Задача существует, но пользователь не создатель (true/false) должен корректно обработать задачу
statusReason: Error: expect(received).rejects.toThrow()

Received promise resolved instead of rejected
Resolved to value: undefined

[Killed] ObjectLiteral
src/task/task.service.ts:140:14
 
   async getUserAssignedTasks(userId: string): Promise<Task[]> {
     return this.tasksRepository.find({
-      where: { assigneeId: userId },
+      where: {},
       relations: ['board'],
       order: { createdAt: 'DESC' },
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен вернуть задачи пользователя (эквивалентный класс по assigneeId)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -3,9 +3,7 @@
      "createdAt": "DESC",
    },

[Killed] StringLiteral
src/task/task.service.ts:141:19
   async getUserAssignedTasks(userId: string): Promise<Task[]> {
     return this.tasksRepository.find({
       where: { assigneeId: userId },
-      relations: ['board'],
+      relations: [""],
       order: { createdAt: 'DESC' },
     });
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен вернуть задачи пользователя (эквивалентный класс по assigneeId)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

  Object {
    "order": Object {
      "createdAt": "DESC",

[Killed] ObjectLiteral
src/task/task.service.ts:142:14
     return this.tasksRepository.find({
       where: { assigneeId: userId },
       relations: ['board'],
-      order: { createdAt: 'DESC' },
+      order: {},
     });
   }
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен вернуть задачи пользователя (эквивалентный класс по assigneeId)
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

@@ -1,9 +1,7 @@
  Object {
-   "order": Object {

[Killed] ObjectLiteral
src/task/task.service.ts:158:38
   }
 
   async findBySprint(sprintId: string): Promise<Task[]> {
-    return this.tasksRepository.find({ where: { sprintId } });
+    return this.tasksRepository.find({});
   }
 
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен вернуть задачи по спринту с правильным условием where
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

- Expected
+ Received

- Object {
-   "where": Object {
-     "sprintId": "sprint-123",

[Killed] BlockStatement
src/task/task.service.ts:167:57
     return task;
   }
 
-  private async sendNotification(notificationData: any) {
-  try {
-    await firstValueFrom(
-      this.httpService.post(
-        `${process.env.API_GATEWAY_URL || 'http://api-gateway:3000'}/notifications`,
-        notificationData
-      )
-    );
-  } catch (error) {
-      // console.error('Failed to send notification:', error);
-    }
-  }
+  private async sendNotification(notificationData: any) {}
 }
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен отправлять уведомление только если assignee отличается от reporter
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
src/task/task.service.ts:168:7
   }
 
   private async sendNotification(notificationData: any) {
-  try {
-    await firstValueFrom(
-      this.httpService.post(
-        `${process.env.API_GATEWAY_URL || 'http://api-gateway:3000'}/notifications`,
-        notificationData
-      )
-    );
-  } catch (error) {
+  try {} catch (error) {
       // console.error('Failed to send notification:', error);
     }
killedBy: TaskService - Decision Testing Тесты после выявленных первой мутацией уязвимостей   должен отправлять уведомление только если assignee отличается от reporter
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Survived] ConditionalExpression
src/task/task.service.ts:171:12
   try {
     await firstValueFrom(
       this.httpService.post(
-        `${process.env.API_GATEWAY_URL || 'http://api-gateway:3000'}/notifications`,
+        `${true}/notifications`,
         notificationData
       )

[Survived] LogicalOperator
src/task/task.service.ts:171:12
   try {
     await firstValueFrom(
       this.httpService.post(
-        `${process.env.API_GATEWAY_URL || 'http://api-gateway:3000'}/notifications`,
+        `${process.env.API_GATEWAY_URL && 'http://api-gateway:3000'}/notifications`,
         notificationData
       )
